# 1. Retrieving Data with SQL

## 1.1 Use select to retrieve data

Run below cell, this will allow you to connect to the **rexon_metals** database.

In [1]:
%load_ext sql
%config SqlMagic.autocommit=False
%config SqlMagic.autolimit=20
%config SqlMagic.displaylimit=20
%sql postgresql://pliu:pliu@127.0.0.1:5432/rexon_metals

To retrieve data from a table, we use the key word **select ... from ...**

For example, below commands retrieve all columns and rows of table customer. Note sql is **not case-sensitive**, so the two select will output exactly the same result

In [2]:
%%sql
select * from customer limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/rexon_metals
5 rows affected.

[(1, 'LITE Industrial', 'Southwest', '729 Ravine Way', 'Irving', 'TX', 75014),
 (2, 'Rex Tooling Inc', 'Southwest', '6129 Collie Blvd', 'Dallas', 'TX', 75201),
 (3, 'Re-Barre Construction', 'Southwest', '9043 Windy Dr', 'Irving', 'TX', 75032),
 (4, 'Prairie Construction', 'Southwest', '264 Long Rd', 'Moore', 'OK', 62104),
 (5, 'Marsh Lane Metal Works', 'Southeast', '9143 Marsh Ln', 'Avondale', 'LA', 79782)]

In [3]:
%%sql
SELECT * FROM CUSTOMER;

 * postgresql://pliu:***@127.0.0.1:5432/rexon_metals
5 rows affected.

[(1, 'LITE Industrial', 'Southwest', '729 Ravine Way', 'Irving', 'TX', 75014),
 (2, 'Rex Tooling Inc', 'Southwest', '6129 Collie Blvd', 'Dallas', 'TX', 75201),
 (3, 'Re-Barre Construction', 'Southwest', '9043 Windy Dr', 'Irving', 'TX', 75032),
 (4, 'Prairie Construction', 'Southwest', '264 Long Rd', 'Moore', 'OK', 62104),
 (5, 'Marsh Lane Metal Works', 'Southeast', '9143 Marsh Ln', 'Avondale', 'LA', 79782)]

In above example, * means all columns, customer is the name of the table.

Try to retrieve the content of table product

In [4]:
%%sql
select * from product;

 * postgresql://pliu:***@127.0.0.1:5432/rexon_metals
9 rows affected.

[(1, 'Copper', Decimal('7.5099999999999997868')),
 (2, 'Aluminum', Decimal('2.580000000000000071')),
 (3, 'Silver', Decimal('15')),
 (4, 'Steel', Decimal('12.310000000000000496')),
 (5, 'Bronze', Decimal('4')),
 (6, 'Duralumin', Decimal('7.5999999999999996447')),
 (7, 'Solder', Decimal('14.160000000000000142')),
 (8, 'Stellite', Decimal('13.310000000000000497')),
 (9, 'Brass', Decimal('4.75'))]

### 1.1.1 Select specific columns

We can also give column names to retrieve data from specific columns. Below command only retrieves data of column product_id and price.

In [6]:
%%sql
select product_id, price from product;

 * postgresql://pliu:***@127.0.0.1:5432/rexon_metals
9 rows affected.

[(1, Decimal('7.5099999999999997868')),
 (2, Decimal('2.580000000000000071')),
 (3, Decimal('15')),
 (4, Decimal('12.310000000000000496')),
 (5, Decimal('4')),
 (6, Decimal('7.5999999999999996447')),
 (7, Decimal('14.160000000000000142')),
 (8, Decimal('13.310000000000000497')),
 (9, Decimal('4.75'))]

### 1.1.2 Do operations on selected columns
We can also perform operations (e.g. mathematical operators(+,-,*,/,%), text operators(||, ),sql operators(count(), round, etc.), etc.) on a column.

For example, suppose the tax rate of a product is 15%, below command will get not only the price, but also the tax of the product

In [7]:
%%sql
select product_id, price, price*0.15 as tax from product;

 * postgresql://pliu:***@127.0.0.1:5432/rexon_metals
9 rows affected.

[(1, Decimal('7.5099999999999997868'), Decimal('1.126499999999999968020')),
 (2, Decimal('2.580000000000000071'), Decimal('0.38700000000000001065')),
 (3, Decimal('15'), Decimal('2.25')),
 (4, Decimal('12.310000000000000496'), Decimal('1.84650000000000007440')),
 (5, Decimal('4'), Decimal('0.60')),
 (6, Decimal('7.5999999999999996447'), Decimal('1.139999999999999946705')),
 (7, Decimal('14.160000000000000142'), Decimal('2.12400000000000002130')),
 (8, Decimal('13.310000000000000497'), Decimal('1.99650000000000007455')),
 (9, Decimal('4.75'), Decimal('0.7125'))]

Note, inside one operation, **you can not use the result that is calculated at the same level**, for example below query is wrong, because
tax is calculated at the same time of total_price. And there is no guaranty that the tax will finish before total_price. So total_price
can not use tax as input argument.

In [11]:
%%sql
select product_id, price, price*0.15 as tax, price+tax as total_price from product;

 * postgresql://pliu:***@127.0.0.1:5432/rexon_metals
(psycopg2.errors.UndefinedColumn) column "tax" does not exist
LINE 1: ...elect product_id, price, price*0.15 as tax, price+tax as tot...
                                                             ^

[SQL: select product_id, price, price*0.15 as tax, price+tax as total_price from product;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [10]:
%%sql
select product_id, price, price*1.15 as total_price from product;

 * postgresql://pliu:***@127.0.0.1:5432/rexon_metals
9 rows affected.

[(1, Decimal('7.5099999999999997868'), Decimal('8.636499999999999754820')),
 (2, Decimal('2.580000000000000071'), Decimal('2.96700000000000008165')),
 (3, Decimal('15'), Decimal('17.25')),
 (4, Decimal('12.310000000000000496'), Decimal('14.15650000000000057040')),
 (5, Decimal('4'), Decimal('4.60')),
 (6, Decimal('7.5999999999999996447'), Decimal('8.739999999999999591405')),
 (7, Decimal('14.160000000000000142'), Decimal('16.28400000000000016330')),
 (8, Decimal('13.310000000000000497'), Decimal('15.30650000000000057155')),
 (9, Decimal('4.75'), Decimal('5.4625'))]

**Note, don't use space in column name, alias or whatever, use _ instead. Because sql consider space as delimiter of string.**

### 1.1.3 Multiple operations on selected columns

We can also combine multi operations on a column. Below query get the total price but only keeps two digits after.

In [12]:
%%sql
select product_id, price, round(price*1.15,2) as total_price from product;

 * postgresql://pliu:***@127.0.0.1:5432/rexon_metals
9 rows affected.

[(1, Decimal('7.5099999999999997868'), Decimal('8.64')),
 (2, Decimal('2.580000000000000071'), Decimal('2.97')),
 (3, Decimal('15'), Decimal('17.25')),
 (4, Decimal('12.310000000000000496'), Decimal('14.16')),
 (5, Decimal('4'), Decimal('4.60')),
 (6, Decimal('7.5999999999999996447'), Decimal('8.74')),
 (7, Decimal('14.160000000000000142'), Decimal('16.28')),
 (8, Decimal('13.310000000000000497'), Decimal('15.31')),
 (9, Decimal('4.75'), Decimal('5.46'))]

### 1.1.3 Rename output column

In the above example, the column price and total_price are confusing. So we want to rename them as **UNTAXED_PRICE and TAXED_PRICE**.

In [13]:
%%sql
select product_id, price as UNTAXED_PRICE, price*1.15 as TAXED_PRICE from product;

 * postgresql://pliu:***@127.0.0.1:5432/rexon_metals
9 rows affected.

[(1, Decimal('7.5099999999999997868'), Decimal('8.636499999999999754820')),
 (2, Decimal('2.580000000000000071'), Decimal('2.96700000000000008165')),
 (3, Decimal('15'), Decimal('17.25')),
 (4, Decimal('12.310000000000000496'), Decimal('14.15650000000000057040')),
 (5, Decimal('4'), Decimal('4.60')),
 (6, Decimal('7.5999999999999996447'), Decimal('8.739999999999999591405')),
 (7, Decimal('14.160000000000000142'), Decimal('16.28400000000000016330')),
 (8, Decimal('13.310000000000000497'), Decimal('15.30650000000000057155')),
 (9, Decimal('4.75'), Decimal('5.4625'))]

## 1.2 Text concatenation

We have seen arithmetic operator above, we can also apply text operator on columns. For instance, you can concatenate the CITY and STATE fields from the CUSTOMER table as well as put a comma and space between them to create a LOCATION value

The **||** is the text concatenation operator, it can concatenate two string to one. Below query uses two concatenation operator to concatenate
three string (i.e. city, ', ' and state).

Note certain database server do make difference between " and ' (e.g. postgresql). Use ' if you can when you specify strings in sql statement, this can avoid many unexpected errors

In [16]:
%%sql

select name, city || ', ' || state from customer;

 * postgresql://pliu:***@127.0.0.1:5432/rexon_metals
5 rows affected.

[('LITE Industrial', 'Irving, TX'),
 ('Rex Tooling Inc', 'Dallas, TX'),
 ('Re-Barre Construction', 'Irving, TX'),
 ('Prairie Construction', 'Moore, OK'),
 ('Marsh Lane Metal Works', 'Avondale, LA')]

We can concatenate as much string as you want, below example we use seven string to build a complete address.

In [17]:
%%sql
SELECT NAME,
STREET_ADDRESS || ' ' || CITY || ', ' || STATE || ' ' || ZIP AS SHIP_ADDRESS
FROM CUSTOMER;

 * postgresql://pliu:***@127.0.0.1:5432/rexon_metals
5 rows affected.

[('LITE Industrial', '729 Ravine Way Irving, TX 75014'),
 ('Rex Tooling Inc', '6129 Collie Blvd Dallas, TX 75201'),
 ('Re-Barre Construction', '9043 Windy Dr Irving, TX 75032'),
 ('Prairie Construction', '264 Long Rd Moore, OK 62104'),
 ('Marsh Lane Metal Works', '9143 Marsh Ln Avondale, LA 79782')]